Revit 2027 API
ElectricalDemandFactorValue.MaxRange Property
 The maximum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the maximum range will be 3.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaxRange { get; set; }
Public Property MaxRange As Double
	Get
	Set
public:
property double MaxRange {
	double get ();
	void set (double value);
}
member MaxRange : float with get, set
Property Value
Double
See Also
Reference
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace